{
  "format": "layers-model",
  "generatedBy": "keras v2.3.1",
  "convertedBy": "TensorFlow.js Converter v1.5.2",
  "modelTopology": {
    "keras_version": "2.3.1",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Model",
      "config": {
        "name": "model_4",
        "layers": [
          {
            "name": "input_1",
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [
                null,
                320,
                480,
                3
              ],
              "dtype": "float32",
              "sparse": false,
              "name": "input_1"
            },
            "inbound_nodes": []
          },
          {
            "name": "block1_conv1",
            "class_name": "Conv2D",
            "config": {
              "name": "block1_conv1",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "input_1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block1_conv2",
            "class_name": "Conv2D",
            "config": {
              "name": "block1_conv2",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "block1_conv1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block1_pool",
            "class_name": "MaxPooling2D",
            "config": {
              "name": "block1_pool",
              "trainable": true,
              "dtype": "float32",
              "pool_size": [
                2,
                2
              ],
              "padding": "valid",
              "strides": [
                2,
                2
              ],
              "data_format": "channels_last"
            },
            "inbound_nodes": [
              [
                [
                  "block1_conv2",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block2_conv1",
            "class_name": "Conv2D",
            "config": {
              "name": "block2_conv1",
              "trainable": true,
              "dtype": "float32",
              "filters": 128,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "block1_pool",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block2_conv2",
            "class_name": "Conv2D",
            "config": {
              "name": "block2_conv2",
              "trainable": true,
              "dtype": "float32",
              "filters": 128,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "block2_conv1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block2_pool",
            "class_name": "MaxPooling2D",
            "config": {
              "name": "block2_pool",
              "trainable": true,
              "dtype": "float32",
              "pool_size": [
                2,
                2
              ],
              "padding": "valid",
              "strides": [
                2,
                2
              ],
              "data_format": "channels_last"
            },
            "inbound_nodes": [
              [
                [
                  "block2_conv2",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block3_conv1",
            "class_name": "Conv2D",
            "config": {
              "name": "block3_conv1",
              "trainable": true,
              "dtype": "float32",
              "filters": 256,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "block2_pool",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block3_conv2",
            "class_name": "Conv2D",
            "config": {
              "name": "block3_conv2",
              "trainable": true,
              "dtype": "float32",
              "filters": 256,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "block3_conv1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block3_conv3",
            "class_name": "Conv2D",
            "config": {
              "name": "block3_conv3",
              "trainable": true,
              "dtype": "float32",
              "filters": 256,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "block3_conv2",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block3_pool",
            "class_name": "MaxPooling2D",
            "config": {
              "name": "block3_pool",
              "trainable": true,
              "dtype": "float32",
              "pool_size": [
                2,
                2
              ],
              "padding": "valid",
              "strides": [
                2,
                2
              ],
              "data_format": "channels_last"
            },
            "inbound_nodes": [
              [
                [
                  "block3_conv3",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block4_conv1",
            "class_name": "Conv2D",
            "config": {
              "name": "block4_conv1",
              "trainable": true,
              "dtype": "float32",
              "filters": 512,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "block3_pool",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block4_conv2",
            "class_name": "Conv2D",
            "config": {
              "name": "block4_conv2",
              "trainable": true,
              "dtype": "float32",
              "filters": 512,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "block4_conv1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block4_conv3",
            "class_name": "Conv2D",
            "config": {
              "name": "block4_conv3",
              "trainable": true,
              "dtype": "float32",
              "filters": 512,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "block4_conv2",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "block4_pool",
            "class_name": "MaxPooling2D",
            "config": {
              "name": "block4_pool",
              "trainable": true,
              "dtype": "float32",
              "pool_size": [
                2,
                2
              ],
              "padding": "valid",
              "strides": [
                2,
                2
              ],
              "data_format": "channels_last"
            },
            "inbound_nodes": [
              [
                [
                  "block4_conv3",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "zero_padding2d_1",
            "class_name": "ZeroPadding2D",
            "config": {
              "name": "zero_padding2d_1",
              "trainable": true,
              "dtype": "float32",
              "padding": [
                [
                  1,
                  1
                ],
                [
                  1,
                  1
                ]
              ],
              "data_format": "channels_last"
            },
            "inbound_nodes": [
              [
                [
                  "block4_pool",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "conv2d_1",
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_1",
              "trainable": true,
              "dtype": "float32",
              "filters": 512,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "zero_padding2d_1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "batch_normalization_1",
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_1",
              "trainable": true,
              "dtype": "float32",
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "conv2d_1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "up_sampling2d_1",
            "class_name": "UpSampling2D",
            "config": {
              "name": "up_sampling2d_1",
              "trainable": true,
              "dtype": "float32",
              "size": [
                2,
                2
              ],
              "data_format": "channels_last",
              "interpolation": "nearest"
            },
            "inbound_nodes": [
              [
                [
                  "batch_normalization_1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "concatenate_1",
            "class_name": "Concatenate",
            "config": {
              "name": "concatenate_1",
              "trainable": true,
              "dtype": "float32",
              "axis": -1
            },
            "inbound_nodes": [
              [
                [
                  "up_sampling2d_1",
                  0,
                  0,
                  {}
                ],
                [
                  "block3_pool",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "zero_padding2d_2",
            "class_name": "ZeroPadding2D",
            "config": {
              "name": "zero_padding2d_2",
              "trainable": true,
              "dtype": "float32",
              "padding": [
                [
                  1,
                  1
                ],
                [
                  1,
                  1
                ]
              ],
              "data_format": "channels_last"
            },
            "inbound_nodes": [
              [
                [
                  "concatenate_1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "conv2d_2",
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_2",
              "trainable": true,
              "dtype": "float32",
              "filters": 256,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "zero_padding2d_2",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "batch_normalization_2",
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_2",
              "trainable": true,
              "dtype": "float32",
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "conv2d_2",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "up_sampling2d_2",
            "class_name": "UpSampling2D",
            "config": {
              "name": "up_sampling2d_2",
              "trainable": true,
              "dtype": "float32",
              "size": [
                2,
                2
              ],
              "data_format": "channels_last",
              "interpolation": "nearest"
            },
            "inbound_nodes": [
              [
                [
                  "batch_normalization_2",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "concatenate_2",
            "class_name": "Concatenate",
            "config": {
              "name": "concatenate_2",
              "trainable": true,
              "dtype": "float32",
              "axis": -1
            },
            "inbound_nodes": [
              [
                [
                  "up_sampling2d_2",
                  0,
                  0,
                  {}
                ],
                [
                  "block2_pool",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "zero_padding2d_3",
            "class_name": "ZeroPadding2D",
            "config": {
              "name": "zero_padding2d_3",
              "trainable": true,
              "dtype": "float32",
              "padding": [
                [
                  1,
                  1
                ],
                [
                  1,
                  1
                ]
              ],
              "data_format": "channels_last"
            },
            "inbound_nodes": [
              [
                [
                  "concatenate_2",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "conv2d_3",
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_3",
              "trainable": true,
              "dtype": "float32",
              "filters": 128,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "zero_padding2d_3",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "batch_normalization_3",
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_3",
              "trainable": true,
              "dtype": "float32",
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "conv2d_3",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "up_sampling2d_3",
            "class_name": "UpSampling2D",
            "config": {
              "name": "up_sampling2d_3",
              "trainable": true,
              "dtype": "float32",
              "size": [
                2,
                2
              ],
              "data_format": "channels_last",
              "interpolation": "nearest"
            },
            "inbound_nodes": [
              [
                [
                  "batch_normalization_3",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "concatenate_3",
            "class_name": "Concatenate",
            "config": {
              "name": "concatenate_3",
              "trainable": true,
              "dtype": "float32",
              "axis": -1
            },
            "inbound_nodes": [
              [
                [
                  "up_sampling2d_3",
                  0,
                  0,
                  {}
                ],
                [
                  "block1_pool",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "zero_padding2d_4",
            "class_name": "ZeroPadding2D",
            "config": {
              "name": "zero_padding2d_4",
              "trainable": true,
              "dtype": "float32",
              "padding": [
                [
                  1,
                  1
                ],
                [
                  1,
                  1
                ]
              ],
              "data_format": "channels_last"
            },
            "inbound_nodes": [
              [
                [
                  "concatenate_3",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "conv2d_4",
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_4",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "zero_padding2d_4",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "batch_normalization_4",
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_4",
              "trainable": true,
              "dtype": "float32",
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "conv2d_4",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "conv2d_5",
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_5",
              "trainable": true,
              "dtype": "float32",
              "filters": 96,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "batch_normalization_4",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "reshape_1",
            "class_name": "Reshape",
            "config": {
              "name": "reshape_1",
              "trainable": true,
              "dtype": "float32",
              "target_shape": [
                38400,
                -1
              ]
            },
            "inbound_nodes": [
              [
                [
                  "conv2d_5",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "activation_1",
            "class_name": "Activation",
            "config": {
              "name": "activation_1",
              "trainable": true,
              "dtype": "float32",
              "activation": "softmax"
            },
            "inbound_nodes": [
              [
                [
                  "reshape_1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          }
        ],
        "input_layers": [
          [
            "input_1",
            0,
            0
          ]
        ],
        "output_layers": [
          [
            "activation_1",
            0,
            0
          ]
        ]
      }
    },
    "training_config": {
      "optimizer_config": {
        "class_name": "Adadelta",
        "config": {
          "learning_rate": 1.0,
          "rho": 0.95,
          "decay": 0.0,
          "epsilon": 1e-07
        }
      },
      "loss": "categorical_crossentropy",
      "metrics": [
        "accuracy"
      ],
      "weighted_metrics": null,
      "sample_weight_mode": null,
      "loss_weights": null
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of12.bin",
        "group1-shard2of12.bin",
        "group1-shard3of12.bin",
        "group1-shard4of12.bin",
        "group1-shard5of12.bin",
        "group1-shard6of12.bin",
        "group1-shard7of12.bin",
        "group1-shard8of12.bin",
        "group1-shard9of12.bin",
        "group1-shard10of12.bin",
        "group1-shard11of12.bin",
        "group1-shard12of12.bin"
      ],
      "weights": [
        {
          "name": "batch_normalization_1/gamma",
          "shape": [
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_1/beta",
          "shape": [
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_1/moving_mean",
          "shape": [
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_1/moving_variance",
          "shape": [
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_2/gamma",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_2/beta",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_2/moving_mean",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_2/moving_variance",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_3/gamma",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_3/beta",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_3/moving_mean",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_3/moving_variance",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_4/gamma",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_4/beta",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_4/moving_mean",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_4/moving_variance",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "block1_conv1/kernel",
          "shape": [
            3,
            3,
            3,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "block1_conv1/bias",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "block1_conv2/kernel",
          "shape": [
            3,
            3,
            64,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "block1_conv2/bias",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "block2_conv1/kernel",
          "shape": [
            3,
            3,
            64,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "block2_conv1/bias",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "block2_conv2/kernel",
          "shape": [
            3,
            3,
            128,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "block2_conv2/bias",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "block3_conv1/kernel",
          "shape": [
            3,
            3,
            128,
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "block3_conv1/bias",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "block3_conv2/kernel",
          "shape": [
            3,
            3,
            256,
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "block3_conv2/bias",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "block3_conv3/kernel",
          "shape": [
            3,
            3,
            256,
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "block3_conv3/bias",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "block4_conv1/kernel",
          "shape": [
            3,
            3,
            256,
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "block4_conv1/bias",
          "shape": [
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "block4_conv2/kernel",
          "shape": [
            3,
            3,
            512,
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "block4_conv2/bias",
          "shape": [
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "block4_conv3/kernel",
          "shape": [
            3,
            3,
            512,
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "block4_conv3/bias",
          "shape": [
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_1/kernel",
          "shape": [
            3,
            3,
            512,
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_1/bias",
          "shape": [
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_2/kernel",
          "shape": [
            3,
            3,
            768,
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_2/bias",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_3/kernel",
          "shape": [
            3,
            3,
            384,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_3/bias",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_4/kernel",
          "shape": [
            3,
            3,
            192,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_4/bias",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_5/kernel",
          "shape": [
            3,
            3,
            64,
            96
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_5/bias",
          "shape": [
            96
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}